Table of Contents
 Interface IProgressMessaging
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public interface IProgressMessaging
Methods
 CancelMessage()
void CancelMessage()
 GetCancellationFlag()
bool GetCancellationFlag()
Returns
bool
 GetCurrentCulture()
CultureInfo GetCurrentCulture()
Returns
CultureInfo
 GetLocalizedText(LocalisedMessage)
string GetLocalizedText(LocalisedMessage msg)
Parameters
msg LocalisedMessage
Returns
string
 InitProgressDialog()
void InitProgressDialog()
 SendMessage(MessageSeverity, string)
void SendMessage(MessageSeverity severity, string text)
Parameters
severity MessageSeverity
text string
 SendMessageInteractive(MessageSeverity, string, string[])
int SendMessageInteractive(MessageSeverity severity, string text, string[] buttons)
Parameters
severity MessageSeverity
text string
buttons string[]
Returns
int
 SendMessageLocalised(MessageSeverity, LocalisedMessage, string)
void SendMessageLocalised(MessageSeverity severity, LocalisedMessage msg, string suffix = "")
Parameters
severity MessageSeverity
msg LocalisedMessage
suffix string
 SetStage(int, int, string)
void SetStage(int stage, int stageMax, string name)
Parameters
stage int
stageMax int
name string
 SetStageLocalised(int, int, LocalisedMessage, params object[])
void SetStageLocalised(int stage, int stageMax, LocalisedMessage msg, params object[] args)
Parameters
stage int
stageMax int
msg LocalisedMessage
args object[]
 SetStageProgress(double)
void SetStageProgress(double percentage)
Parameters
percentage double
 Edit this page